/*********************************************************************
 *
 *                         bstv51.c
 *
 *********************************************************************
 * 描    述: BST-V51开发板初始化
 * 开发平台: BST-V51开发板+KEIL C51
 ********************************************************************/

#include <reg52.h>/*包含51系统头文件*/
#include "bstv51.h"/*包含BST-V51开发板头文件*/

/*BST-V51主板初始化函数*/
void bstv51_init(void)
{
	/* 引脚方向、输出初值定义 */
	FM=1;/*蜂鸣器*/
	EN=0;/*让LCD1602数据口处于输入状态，相当于LCD1602使不能，让其释放数据总线*/
	CS=1;/*TF卡使不能*/
	RST=0;/*ds1302使不能*/
}

